//-----------------------------------------------------------------
//   PWM输出头文件
// 头文件名: PWM.h
// 作    者: 凌智电子
// 编写日期: 2014-01-27
// 修改日期:
//-----------------------------------------------------------------

#ifndef _PWMOutput_H
#define _PWMOutput_H

//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------

void TIM2_Mode_Init(void);
void TIM2_GPIO_Init(void);
extern void TIM2_PWMOutput_Init(void);

#endif
