#include "filter.h"
/***************************滤波器系数******************************************/
float IIRCoeff[5] = {  0.9854966362737,                 

 -1.970612877842,0.9713736672526   ,-2,0.8912509381337};//300HZ高通

float IIRCoeff1[5] = {  3.922054542727e-05,                                  

 -1.98679155702,0.9869484392022    ,2,0.8912509381337};//200HZ低通 偏置设为1V左右
 
float IIRCoeff2[5] = {  0.001907337715071,                                              

 -1.995763967132, 0.9961853245699 ,0,1};//250-300HZ带通
float IIRCoeff3[5] = {   0.9996195279725,                                              

 -1.999183686628, 0.9992390559449,-1.999944609608,1};//100HZ带阻
/******************************************************************************/ 
 
/******************低通及高通2阶拓扑处理函数***********************************
 **y :输出数组
 **x :输入数组
 **IIRCoeff :抽头系数
 **ny :数据个数
*******************************************************************************/

void iir_biquad_stm32(float *y, float *x, float *IIRCoeff, u16 ny)

{
  static float w1_2 = 0, w1_1 = 0, w1;

  /** Canonic form **/

  /* 1st section */

    w1 = IIRCoeff[0]*x[0] - IIRCoeff[1]*w1_1 - IIRCoeff[2]*w1_2;

    y[0] = (w1 + IIRCoeff[3]*w1_1 + w1_2)*IIRCoeff[4];

    w1_2 = w1_1;

    w1_1 = w1;

}

//带通专用
void iir_biquad_stm32_x(float *y, float *x, float *IIRCoeff, u16 ny)

{
  static float w1_2 = 0, w1_1 = 0, w1;

  /** Canonic form **/

  /* 1st section */

    w1 = IIRCoeff[0]*x[0] - IIRCoeff[1]*w1_1 - IIRCoeff[2]*w1_2;

    y[0] = (w1 + IIRCoeff[3]*w1_1 - w1_2)*IIRCoeff[4];

    w1_2 = w1_1;

    w1_1 = w1;

}
